'use strict'

Q1: BIOSとはなんですか？

Q2: OSに対するBIOSの役割を説明してください。

Q3: カーネルとはなんですか？

Q4: シェルとはなんですか？

Q5: CPUのクロック性能とはなんですか？

Q6: CPUのクロック性能が高いと何が嬉しいですか？

Q7: CPUのコア数とはなんですか？

Q8: CPUのコア数が多いと何が嬉しいですか？

Q9: IntelやAMDのCPUでは動作するアプリが、M1 Mac などでは動かない場合があるのはなぜですか？

Q10: メモリ容量が大きいと何が嬉しいですか？

Q11: メモリリークとは何ですか？

Q12: SSDとHDDの違いを説明してください。

Q13: SSDへのデータ読み書きとメモリへのデータ読み書きはどちらが高速ですか？

Q14: 世の中には SAP HANA や Apache Spark のようなインメモリシステムがあります。通常のアプリケーションと比べて何が優れていますか？

Q15: ネイティブアプリとWebアプリの違いを説明してください。

Q16: Webアプリがネイティブアプリに対して優れている点・不便な点はそれぞれなんですか？